include/fedex/wsdl/CreatePendingShipmentRequest.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><SOAP-ENV:Body><CreatePendingShipmentRequest xmlns="http://fedex.com/ws/ship/v8"><WebAuthenticationDetail><UserCredential><Key></Key><Password></Password></UserCredential></WebAuthenticationDetail><ClientDetail><AccountNumber></AccountNumber><MeterNumber></MeterNumber></ClientDetail><UserDetail><UserId/><Password/><UniqueUserId/></UserDetail><TransactionDetail><CustomerTransactionId>TC01_US_US_E01011_Non-Mobi_ship_ServPak_POS</CustomerTransactionId></TransactionDetail><Version><ServiceId>ship</ServiceId><Major>8</Major><Intermediate>0</Intermediate><Minor>0</Minor></Version><RequestedShipment><ShipTimestamp>2010-02-09T09:30:47-05:00</ShipTimestamp><DropoffType>REGULAR_PICKUP</DropoffType><ServiceType>PRIORITY_OVERNIGHT</ServiceType><PackagingType>YOUR_PACKAGING</PackagingType><Shipper><AccountNumber></AccountNumber><Contact><PersonName>Sender Contact</PersonName><CompanyName>WAPI_Sender</CompanyName><PhoneNumber>1234567890</PhoneNumber></Contact><Address><StreetLines>Test Sender Address Line1</StreetLines><City>Collierville</City><StateOrProvinceCode>TN</StateOrProvinceCode><PostalCode>38017</PostalCode><CountryCode>US</CountryCode></Address></Shipper><Recipient><AccountNumber></AccountNumber><Contact><PersonName>Recipient Contact</PersonName><CompanyName>WAPI_Receiver</CompanyName><PhoneNumber>1234567890</PhoneNumber></Contact><Address><StreetLines>Recipient Address Line1</StreetLines><City>Austin</City><StateOrProvinceCode>TX</StateOrProvinceCode><PostalCode>73301</PostalCode><CountryCode>US</CountryCode></Address></Recipient><ShippingChargesPayment><PaymentType>SENDER</PaymentType><Payor><AccountNumber></AccountNumber><CountryCode>USD</CountryCode></Payor></ShippingChargesPayment><SpecialServicesRequested><SpecialServiceTypes>PENDING_SHIPMENT</SpecialServiceTypes><PendingShipmentDetail><Type>EMAIL</Type><ExpirationDate>2010-03-28</ExpirationDate><EmailLabelDetail><NotificationEMailAddress>Satish_shinde@syntelinc.com</NotificationEMailAddress><NotificationMessage>shipmentisdonetracpending</NotificationMessage></EmailLabelDetail></PendingShipmentDetail></SpecialServicesRequested><LabelSpecification><LabelFormatType>COMMON2D</LabelFormatType><ImageType>PNG</ImageType></LabelSpecification><RateRequestTypes>ACCOUNT</RateRequestTypes><PackageCount>1</PackageCount><PackageDetail>INDIVIDUAL_PACKAGES</PackageDetail><RequestedPackageLineItems><SequenceNumber>1</SequenceNumber><Weight><Units>LB</Units><Value>50.0</Value></Weight><Dimensions><Length>5</Length><Width>5</Width><Height>5</Height><Units>IN</Units></Dimensions><PhysicalPackaging>BAG</PhysicalPackaging><ItemDescription>Book</ItemDescription><CustomerReferences><CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType><Value>NAFTA_COO</Value></CustomerReferences></RequestedPackageLineItems></RequestedShipment></CreatePendingShipmentRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>